src/XMLtemplates/104-03_1G_AirBook_Rq.xml

<!--Release 8.1--><!--Version Dated as of 15/Apr/2015 11:24:07-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <univ:AirCreateReservationReq AuthorizedBy="user" RetainReservation="Both" TargetBranch="{{TargetBranch}}"
                                      TraceId="{{requestId}}" xmlns:univ="http://www.travelport.com/schema/">
            <com:BillingPointOfSaleInfo OriginApplication="UAPI" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
            {{#passengers}}
            <com:BookingTraveler Key="P_{{@index}}" DOB="1967-11-23" Gender="M" TravelerType="ADT" xmlns:com="http://www.travelport.com/schema/common_v33_0">
                <com:BookingTravelerName First="{{firstName}}" Last="{{lastName}}" Prefix="{{title}}"/>
                <com:DeliveryInfo> {{! TODO move into config}
                    <com:ShippingAddress>
                        <com:AddressName>Agency</com:AddressName>
                        <com:Street>Mezhygirska St. 1</com:Street>
                        <com:City>Kyiv</com:City>
                        <com:PostalCode>123456</com:PostalCode>
                        <com:Country>UA</com:Country>
                    </com:ShippingAddress>
                </com:DeliveryInfo>
                <com:PhoneNumber CountryCode="38" Location="IEV" Number="044" Type="Agency"/> {{! TODO move into config}
                <com:Email EmailID="{{email}}" Type="Home"/>
                <com:Email EmailID="avia@711.ua" Type="Agency"/> {{! TODO move into config}}
                {{#ssr}}
                <com:SSR Type="{{type}}" FreeText="{{text}}"/>
                {{/ssr}}
            </com:BookingTraveler>
            {{/passengers}}
            <com:FormOfPayment Key="jwt2mcK1Qp27I2xfpcCtAw==" Type="Cash" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
            {{pricingSolutionXML}}
            <com:ActionStatus ProviderCode="1G" TicketDate="2015-04-14T18:09:13" Type="TAW"/>
        </univ:AirCreateReservationReq>
    </soap:Body>
</soap:Envelope>